/*******************************************************************************
****入口参数：无
****出口参数：无
****函数备注：时钟切换测试
****版权信息：蓝旗嵌入式系统
*******************************************************************************/
#include"iostm8l152k4.h"
//定义LED端口
#define LED_PORT PC_ODR_ODR4
/*******************************************************************************
****入口参数：无
****出口参数：无
****函数备注：GPIO配置，配置PC4输出
****版权信息：蓝旗嵌入式系统
*******************************************************************************/
void Init_GPIO(void)
{
       PC_DDR_DDR4 = 1;//输出
       PC_CR1_C14 = 1; //推挽输出
       PC_CR2_C24 = 0;//输出速率2M
	   
	   
}
/*******************************************************************************
****入口参数：ms，延时的数目
****出口参数：无
****函数备注：非精确延时函数
****版权信息：蓝旗嵌入式系统
*******************************************************************************/
void delay(unsigned int ms)
{
       unsigned char i;
       while(ms!=0)
       {
              for(i=0;i<250;i++)
              {}
              for(i=0;i<75;i++)
              {}
              ms--;
       }
}
/*******************************************************************************
****入口参数：无
****出口参数：无
****函数备注：时钟源切换、分频，通过LED闪烁频率区分是否成功
****版权信息：蓝旗嵌入式系统
*******************************************************************************/
int main( void )
{
        unsigned char i;
	Init_GPIO();   //初始化I/O
	//启用内部高速晶振且无分频16MHz
	CLK_ICKCR|=0x01;      //开启内部HSI
	while(!(CLK_ICKCR&0x02));//HSI准备就绪
	CLK_SWR=0x01;        //HSI为主时钟源
	CLK_CKDIVR=0x00;     //HSI不分频
	for(i=0;i<10;i++)    //闪烁LED
	{
		LED_PORT=1;
		delay(500);
                LED_PORT=0;
		delay(500);
	}
	//启用内部高速晶振且8分频(内部时钟分频)2MHz
      	CLK_CKDIVR=0x03;   //HSI8分频，2M，复位后的默认值
	for(i=0;i<10;i++)   //闪烁LED
	{
		LED_PORT=1;
		delay(500);
                LED_PORT=0;
		delay(500);
	}
		
	while (1)
	{
          
               //启用内部高速晶振HSI且无分频16MHz
				
                CLK_SWCR|=0x02; //开启切换
                CLK_ICKCR|=0x01;      //开启内部HSI
		while(!(CLK_ICKCR&0x02));//HSI准备就绪
		CLK_SWR=0x01;        //HSI为主时钟源
                while((CLK_SWCR & 0x01)==0x01);//等待切换完成
                CLK_CKDIVR=0x00;     //HSI不分频
                CLK_SWCR&=(~0x02); //关闭切换
                for(i=0;i<10;i++)
                 {
			LED_PORT=1;
			delay(500);
                        LED_PORT=0;
			delay(500);
		  }
	
	
               //启用内部低速晶振LSI且无分频
			  
               CLK_SWCR|=0x02; //开启切换
               CLK_ICKCR|=0x04; //开启LSI
	       while(!(CLK_ICKCR&0x08));//LSI准备就绪
	       CLK_SWR=0x02;   //LSI为主时钟源
               while((CLK_SWCR & 0x01)==0x01);//等待切换完成
               CLK_CKDIVR=0x00;   //LSI不分频
               CLK_SWCR&=(~0x02); //关闭切换
        
               LED_PORT=1;      //LED闪烁
               delay(100);
               LED_PORT=0;
               delay(100);
        
				
              //启用外部高速晶振且16分频，外部晶振1-16MHz
              CLK_SWCR|=0x02; //开启切换
              CLK_ECKR|=0x01;//开启HSE
              while(!(CLK_ECKR&0x02));//HSE准备就绪
              CLK_SWR=0x04;//HSE为主时钟源
              while((CLK_SWCR & 0x01)==0x01);//等待切换完成
              CLK_CKDIVR=0x04;
              CLK_SWCR&=(~0x02); //关闭切换
              for(i=0;i<10;i++)
              {
		 LED_PORT=1;
		 delay(500);
		 LED_PORT=0;
		 delay(500);
              }
              
              //启用外部低速晶振不分频，32768
              CLK_SWCR|=0x02; //开启切换
              CLK_ECKR|=0x04;//开启LSE
              while(!(CLK_ECKR&0x08));//HSL准备就绪
              CLK_SWR=0x08;//LSE为主时钟源
              while((CLK_SWCR & 0x01)==0x01);//等待切换完成
              CLK_CKDIVR=0x00;
              CLK_SWCR&=(~0x02); //关闭切换
              for(i=0;i<10;i++)
              {
		 LED_PORT=1;
		 delay(100);
		 LED_PORT=0;
		 delay(100);
              }
				
       }
}

/*******************************************************************************
*******************************蓝旗嵌入式系统***********************************
*************************http://lenchimcu.taobao.com****************************
*******************************************************************************/